// #1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let str = '';
const comma = "  "; 
var dx = 0.5; 
for (let i = 20; i < 31; ++i) {
  str = str  + i + comma;
  i += dx -1 ;
}
console.log(str);


// 2.Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

// let str = '';
// const comma = "  "; 
// var dx = 10; 
// for (let i = 10; i < 100; ++i) {
//   str = str  + i*27 + comma;
//   i += dx-1;
// }
// console.log(str);



// 3.Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

// const targetNumber = 325;
// for (let i = 1; i <= 100; i++) {
//   let multiplyResult = i * i;

//   if (multiplyResult <=targetNumber){
//     console.log( multiplyResult)
//   }
//   }


// // #4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

// function Number(n) {
//   if (n > 1) {
//         for (let i = 2 ; i < n ; i++) {
//       if (n % i === 0) {
//         return 'Непросте число'
//       }
//     }
//     return 'Просте число'
//   }
//   return 'Помилка'
//  }
 
//  alert( Number(prompt('Надайте число: ') ) )


  // 5.Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
  // let number = prompt("Надайте число:");
  // while (number % 3 === 0) {
  //   number /= 3;
  // }
  // console.log("Mожна отримати")



      
